<script setup lang="ts">
  import { useComebacker } from "@/utils/common.ts";
  import CalculatorBottom from '@/components/CalculatorBottom.vue';

  useComebacker();
</script>

<template>
  <div class="container space-y-10 md:px-8 px-4 md:py-12 py-6" data-aos="fade-in">
    <div class="space-y-5">
      <h2 class="text-4xl font-bold text-black">
        О сервисе
      </h2>
      <p>
        Сервис оказывает платные услуги по подбору кредитных продуктов для клиентов, а именно
        предлагает клиенту список предложений кредитных учреждений, и прочих финансовых организаций,
        в которые клиент может обратиться с целью оформления заявки на кредитный продукт.
      </p>
      <p>
        Комиссия сервиса списывается с привязанной пользователем банковской карты. Сервис не является
        банком или кредитором, не относится к финансовым учреждениям и не несёт ответственности за
        последствия любых заключенных договоров кредитования или условия по ним.
      </p>
      <p>
        Персональные данные защищены. Вся указанная информация находится в безопасности. Мы не
        передаём персональные данные третьим лицам. Никто кроме вас не имеет доступ к информации
        которую вы заполнили на сайте.
      </p>
      <p>
        Услуга обработки заявки является платной и составляет от 99 до {{ $config.sum }} рублей. Списания по
        подписке производятся раз в 30 дней. Возможно списание частями! Сумма списаний не может превысить
        {{ $config.sum }} рублей в месяц. Подробная информация в договоре публичной оферты. Услуга
        далее по сайту — «Активация сервиса». Активация сервиса не гарантирует вам получение займа.
      </p>
      <p>
        Если услуга перестала быть актуальна для вас, вы можете самостоятельно отписаться от услуги в
        любой момент —
        <router-link
          class="text-primary hover:text-primary-light transition"
          to="/unsubscribe">
          Отписаться
        </router-link>
      </p>
      <p>
        Услуги на проекте оказываются
        {{ $config.type }} {{ $config.legalEntity }} ИНН: {{ $config.inn }},
        Оператор персональных данных {{ $config.rknNumber }},
        Приказ №{{ $config.order }}.
        Фактический адрес: {{ $config.address }}
      </p>
    </div>
    <div class="space-y-5">
      <h2 class="text-3xl font-bold text-black">
        Описание условий возврата
      </h2>
      <p>
        Возврат осуществляется на основании заполненного заявления. Для того, чтобы осуществить
        возврат, необходимо отправить заявку на почту
        <a
          :href="`tel:${ $config.email }`"
          class="text-primary hover:text-primary-light transition cursor-pointer">
          {{ $config.email }}
        </a>
        и получить инструкцию от
        менеджера нашего сервиса.
      </p>
      <p>
        Если покупка была оплачена банковской картой, средства будут возвращены на карту, с которой
        была совершена оплата в течение 30 календарных дней с даты заполненного заявления на возврат.
      </p>
    </div>
    <div class="space-y-5">
      <h2 class="text-3xl font-bold text-black">
        Политика возврата платежей
      </h2>
      <p>
        Уважаемые Клиенты, информируем Вас о том, что при запросе возврата денежных средств при
        отказе от покупки, возврат производится исключительно на ту же банковскую карту, с которой
        была произведена оплата.
      </p>
    </div>
    <CalculatorBottom/>
  </div>
</template>
