<script setup lang="ts">
  import { useComebacker } from "@/utils/common.ts";
  import CalculatorBottom from "@/components/CalculatorBottom.vue";

  useComebacker();
</script>

<template>
  <div class="container py-12 px-4">
    <div class="space-y-8">
      <div class="space-y-4" data-aos="fade-in">
        <h2 class="text-4xl font-bold text-black">
          Уважаемый клиент!
        </h2>
        <p class="text-black">
          Вы можете оплатить свою услугу онлайн с помощью банковской карты через платежный сервис. После подтверждения
          услуги Вы будете перенаправлены на защищенную платежную страницу, где необходимо будет ввести данные для
          оплаты услуги. После успешной оплаты на указанную в форме оплаты электронную почту будет направлен электронный
          чек с информацией об услуге и данными по произведенной оплате.
        </p>
      </div>

      <div class="space-y-4" data-aos="fade-in">
        <h2 class="text-4xl font-bold text-black">
          Гарантии безопасности
        </h2>
        <p class="text-black">
          Безопасность процессинга подтверждена сертификатом стандарта безопасности данных индустрии платежных карт
          PCI DSS. Надежность сервиса обеспечивается интеллектуальной системой мониторинга мошеннических операций,
          а также применением 3D Secure - современной технологией безопасности интернет-платежей. Данные Вашей карты
          вводятся на специальной защищенной платежной странице. Передача информации в процессинговую компанию
          происходит с применением технологии шифрования TLS. Дальнейшая передача информации осуществляется по
          закрытым банковским каналам, имеющим наивысший уровень надежности.
        </p>
      </div>

      <CalculatorBottom/>
    </div>
  </div>
</template>
